import pytest


@pytest.fixture
def card_number():
    return [
        (7000792289606361, "7000 79** **** 6361"),
        ("7000792289606361", "7000 79** **** 6361"),
        (70007922896063611, "Некорректный номер карты!"),
        (700079228960636, "Некорректный номер карты!"),
        ("", "Некорректный номер карты!"),
        (" ", "Некорректный номер карты!"),
        ("jhgfdsaeyudhfydt", "Некорректный номер карты!"),
    ]


@pytest.fixture
def account_number():
    return 73654108430135874305
